# 2026.10.05力扣网刷题
# 856. 括号的分数——资深工程师、栈、字符串、括号序列、第90场周赛——中等
# 给定一个平衡括号字符串 S，按下述规则计算该字符串的分数：
# () 得 1 分。
# AB 得 A + B 分，其中 A 和 B 是平衡括号字符串。
# (A) 得 2 * A 分，其中 A 是平衡括号字符串。
# 示例 1：
# 输入： "()"
# 输出： 1
# 示例 2：
# 输入： "(())"
# 输出： 2
# 示例 3：
# 输入： "()()"
# 输出： 2
# 示例 4：
# 输入： "(()(()))"
# 输出： 6
# 提示：
# S 是平衡括号字符串，且只含有(和) 。
# 2 <= S.length <= 50

class Solution:
    def scoreOfParentheses(self, s: str) -> int:
        ans, depth = 0, 0
        for i in range(len(s)):
            if s[i] == '(':
                depth += 1
            else:
                if s[i - 1] == '(':
                    ans += 1 << (depth - 1)
                depth -= 1
        return ans